uli/basicengine-firmware/libraries/ESP8266SAM/src/sam.cpp
#include "ESP8266SAM.h"
#include <stdio.h> // define printf()
#include <string.h> // strlen()
//#include <stdlib.h>
#include <stddef.h> // define NULL
#include "debug.h"
#include "SamTabs.h"

//standard sam sound
//unsigned char speed = 72;
//unsigned char pitch = 64;
//static unsigned char mouth = 128;
//static unsigned char throat = 128;
//int singmode = 0;

//extern int debug;

//unsigned char mem59=0;

//char *buffer = NULL;


void ESP8266SAM::SetInput(char *_input)
{
  int i, l;
  l = strlen(_input);
  if (l > 254) l = 254;
  for (i = 0; i < l; i++)
    input[i] = _input[i];
  input[l] = 0;
}

// 168=pitches
// 169=frequency1
// 170=frequency2
// 171=frequency3
// 172=amplitude1
// 173=amplitude2
// 174=amplitude3

extern const unsigned char freq1data_init[] PROGMEM;
extern const unsigned char freq2data_init[] PROGMEM;
extern const unsigned char freq3data_init[] PROGMEM;
void ESP8266SAM::Init()
{
  int i;
  dbg_sam("init\n");
  memcpy_P(freq1data, freq1data_init, sizeof(freq1data));
  memcpy_P(freq2data, freq2data_init, sizeof(freq2data));
  memcpy_P(freq3data, freq3data_init, sizeof(freq3data));
  SetMouthThroat( mouth, throat);

  bufferpos = 0;
  // TODO, check for free the memory, 10 seconds of output should be more than enough
//	buffer = malloc(22050*10);

  /*
     freq2data = &mem[45136];
     freq1data = &mem[45056];
     freq3data = &mem[45216];
   */
  //pitches = &mem[43008];
  /*
     frequency1 = &mem[43264];
     frequency2 = &mem[43520];
     frequency3 = &mem[43776];
   */
  /*
     amplitude1 = &mem[44032];
     amplitude2 = &mem[44288];
     amplitude3 = &mem[44544];
   */
  //phoneme = &mem[39904];
  /*
     ampl1data = &mem[45296];
     ampl2data = &mem[45376];
     ampl3data = &mem[45456];
   */

  for (i = 0; i < 256; i++)
  {
    stress[i] = 0;
    phonemeLength[i] = 0;
  }

  for (i = 0; i < 60; i++)
  {
    phonemeIndexOutput[i] = 0;
    stressOutput[i] = 0;
    phonemeLengthOutput[i] = 0;
  }
  phonemeindex[255] = 255;       //to prevent buffer overflow // ML : changed from 32 to 255 to stop freezing with long inputs

}


void (*outcb)(void *, unsigned char) = NULL;
void *outcbdata = NULL;

//int Code39771()
int ESP8266SAM::SAMMain( void (*cb)(void *, unsigned char), void *cbd )
{
  outcb = cb;
  outcbdata = cbd;
  Init();
  phonemeindex[255] = 32;       //to prevent buffer overflow

  if (!Parser1()) return 0;
  if (debug)
    PrintPhonemes(phonemeindex, phonemeLength, stress);
  Parser2();
  CopyStress();
  SetPhonemeLength();
  AdjustLengths();
  Code41240();
  do
  {
    A = phonemeindex[X];
    if (A > 80)
    {
      phonemeindex[X] = 255;
      break;                   // error: delete all behind it
    }
    X++;
  } while (X != 0);

  //pos39848:
  InsertBreath();

  //mem[40158] = 255;
  if (debug)
  {
    PrintPhonemes(phonemeindex, phonemeLength, stress);
  }

  A = 0;
  X = 0;
  Y = 0;

  return 1;
}

int ESP8266SAM::SAMPrepare()
{
  Init();
  phonemeindex[255] = 32; //to prevent buffer overflow

  if (!Parser1()) return 0;
  Parser2();
  CopyStress();
  SetPhonemeLength();
  AdjustLengths();
  Code41240();
  do
  {
    A = phonemeindex[X];
    if (A > 80)
    {
      phonemeindex[X] = 255;
      break; // error: delete all behind it
    }
    X++;
  } while (X != 0);

  InsertBreath();
  return 1;
}



//void Code48547()
void ESP8266SAM::PrepareOutput()
{
  dbg_sam("prepo\n");
  if (prepo_reset_xy) {
    prepo_reset_xy = false;
    X = prepo_reset_x_value;
    Y = 0;
  }
  last_loop = false;

  //pos48551:
  while (1)
  {
    A = phonemeindex[X];
    if (A == 255)
    {
      A = 255;
      phonemeIndexOutput[Y] = 255;
      render_state = RENDER_REND;
      last_loop = true;
      return;
    }
    if (A == 254)
    {
      X++;
      int temp = X;
      //mem[48546] = X;
      phonemeIndexOutput[Y] = 255;
      render_state = RENDER_REND;
      //X = mem[48546];
      prepo_reset_xy = true;
      prepo_reset_x_value = temp;
      return;
    }

    if (A == 0)
    {
      X++;
      continue;
    }

    phonemeIndexOutput[Y] = A;
    phonemeLengthOutput[Y] = phonemeLength[X];
    stressOutput[Y] = stress[X];
    X++;
    Y++;
  }
}

//void Code48431()
void ESP8266SAM::InsertBreath()
{
  unsigned char mem54;
  unsigned char mem55;
  unsigned char index;       //variable Y
  mem54 = 255;
  X++;
  mem55 = 0;
  unsigned char mem66 = 0;
  while (1)
  {
    //pos48440:
    X = mem66;
    index = phonemeindex[X];
    if (index == 255) return;
    mem55 += phonemeLength[X];

    if (mem55 < 232)
    {
      if (index != 254)                   // ML : Prevents an index out of bounds problem
      {
	A = pgm_read_byte(&flags2[index])&1;
	if (A != 0)
	{
	  X++;
	  mem55 = 0;
	  Insert(X, 254, mem59, 0);
	  mem66++;
	  mem66++;
	  continue;
	}
      }
      if (index == 0) mem54 = X;
      mem66++;
      continue;
    }
    X = mem54;
    phonemeindex[X] = 31;               // 'Q*' glottal stop
    phonemeLength[X] = 4;
    stress[X] = 0;
    X++;
    mem55 = 0;
    Insert(X, 254, mem59, 0);
    X++;
    mem66 = X;
  }

}

// Iterates through the phoneme buffer, copying the stress value from
// the following phoneme under the following circumstance:

//     1. The current phoneme is voiced, excluding plosives and fricatives
//     2. The following phoneme is voiced, excluding plosives and fricatives, and
//     3. The following phoneme is stressed
//
//  In those cases, the stress value+1 from the following phoneme is copied.
//
// For example, the word LOITER is represented as LOY5TER, with as stress
// of 5 on the diphtong OY. This routine will copy the stress value of 6 (5+1)
// to the L that precedes it.


//void Code41883()
void ESP8266SAM::CopyStress()
{
  // loop thought all the phonemes to be output
  unsigned char pos = 0;     //mem66
  while (1)
  {
    // get the phomene
    Y = phonemeindex[pos];

    // exit at end of buffer
    if (Y == 255) return;

    // if CONSONANT_FLAG set, skip - only vowels get stress
    if ((pgm_read_byte(&flags[Y]) & 64) == 0) {pos++; continue; }
    // get the next phoneme
    Y = phonemeindex[pos+1];
    if (Y == 255)             //prevent buffer overflow
    {
      pos++; continue;
    } else
    // if the following phoneme is a vowel, skip
    if ((pgm_read_byte(&flags[Y]) & 128) == 0) {pos++; continue; }

    // get the stress value at the next position
    Y = stress[pos+1];

