uli/basicengine-firmware/libraries/ESP8266SAM/src/sam.cpp
    // WALK BACK THROUGH TABLE LOOKING FOR A MATCH
    while ((sign1 != pgm_read_byte(stressInputTable+Y) /*stressInputTable[Y]*/) && (Y > 0))
    {
      // DECREMENT INDEX
      Y--;
    }

    // REACHED THE END OF THE SEARCH WITHOUT BREAKING OUT OF LOOP?
    if (Y == 0)
    {
      //mem[39444] = X;
      //41181: JSR 42043 //Error
      // FAILED TO MATCH ANYTHING, RETURN 0 ON FAILURE
      return 0;
    }
// SET THE STRESS FOR THE PRIOR PHONEME
    stress[position-1] = Y;
  }       //while
}




//change phonemelength depedendent on stress
//void Code41203()
void ESP8266SAM::SetPhonemeLength()
{
  unsigned char A;
  int position = 0;
  while (phonemeindex[position] != 255)
  {
    A = stress[position];
    //41218: BMI 41229
    if ((A == 0) || ((A&128) != 0))
    {
      phonemeLength[position] = pgm_read_byte(&phonemeLengthTable[phonemeindex[position]]);
    } else
    {
      phonemeLength[position] = pgm_read_byte(&phonemeStressedLengthTable[phonemeindex[position]]);
    }
    position++;
  }
}


void ESP8266SAM::Code41240()
{
  unsigned char pos = 0;

  while (phonemeindex[pos] != 255)
  {
    unsigned char index;             //register AC
    X = pos;
    index = phonemeindex[pos];
    if ((pgm_read_byte(&flags[index])&2) == 0)
    {
      pos++;
      continue;
    } else
    if ((pgm_read_byte(&flags[index])&1) == 0)
    {
      Insert(pos+1, index+1, pgm_read_byte(&phonemeLengthTable[index+1]), stress[pos]);
      Insert(pos+2, index+2, pgm_read_byte(&phonemeLengthTable[index+2]), stress[pos]);
      pos += 3;
      continue;
    }

    do
    {
      X++;
      A = phonemeindex[X];
    } while (A == 0);

    if (A != 255)
    {
      if ((pgm_read_byte(&flags[A]) & 8) != 0) {pos++; continue; }
      if ((A == 36) || (A == 37)) {pos++; continue; }                  // '/H' '/X'
    }

    Insert(pos+1, index+1, pgm_read_byte(&phonemeLengthTable[index+1]), stress[pos]);
    Insert(pos+2, index+2, pgm_read_byte(&phonemeLengthTable[index+2]), stress[pos]);
    pos += 3;
  };

}

// Rewrites the phonemes using the following rules:
//
//       <DIPHTONG ENDING WITH WX> -> <DIPHTONG ENDING WITH WX> WX
//       <DIPHTONG NOT ENDING WITH WX> -> <DIPHTONG NOT ENDING WITH WX> YX
//       UL -> AX L
//       UM -> AX M
//       <STRESSED VOWEL> <SILENCE> <STRESSED VOWEL> -> <STRESSED VOWEL> <SILENCE> Q <VOWEL>
//       T R -> CH R
//       D R -> J R
//       <VOWEL> R -> <VOWEL> RX
//       <VOWEL> L -> <VOWEL> LX
//       G S -> G Z
//       K <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> KX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
//       G <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> GX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
//       S P -> S B
//       S T -> S D
//       S K -> S G
//       S KX -> S GX
//       <ALVEOLAR> UW -> <ALVEOLAR> UX
//       CH -> CH CH' (CH requires two phonemes to represent it)
//       J -> J J' (J requires two phonemes to represent it)
//       <UNSTRESSED VOWEL> T <PAUSE> -> <UNSTRESSED VOWEL> DX <PAUSE>
//       <UNSTRESSED VOWEL> D <PAUSE>  -> <UNSTRESSED VOWEL> DX <PAUSE>


//void Code41397()
void ESP8266SAM::Parser2()
{
  dbg_sam("Parser2\n");
  unsigned char pos = 0;       //mem66;
  unsigned char mem58 = 0;


  // Loop through phonemes
  while (1)
  {
// SET X TO THE CURRENT POSITION
    X = pos;
// GET THE PHONEME AT THE CURRENT POSITION
    A = phonemeindex[pos];

// DEBUG: Print phoneme and index
    if (A != 255) dbg_sam("%d: %c%c\n", X, signInputTable1[A], signInputTable2[A]);

// Is phoneme pause?
    if (A == 0)
    {
// Move ahead to the
      pos++;
      continue;
    }

// If end of phonemes flag reached, exit routine
    if (A == 255) return;

// Copy the current phoneme index to Y
    Y = A;

// RULE:
//       <DIPHTONG ENDING WITH WX> -> <DIPHTONG ENDING WITH WX> WX
//       <DIPHTONG NOT ENDING WITH WX> -> <DIPHTONG NOT ENDING WITH WX> YX
// Example: OIL, COW


// Check for DIPHTONG
    if ((pgm_read_byte(&flags[A]) & 16) == 0) goto pos41457;

// Not a diphthong. Get the stress
    mem58 = stress[pos];

// End in IY sound?
    A = pgm_read_byte(&flags[Y]) & 32;

// If ends with IY, use YX, else use WX
    if (A == 0) A = 20; else A = 21;                // 'WX' = 20 'YX' = 21
    //pos41443:
// Insert at WX or YX following, copying the stress

    if (A == 20) dbg_sam("RULE: insert WX following diphtong NOT ending in IY sound\n");
    if (A == 21) dbg_sam("RULE: insert YX following diphtong ending in IY sound\n");
    Insert(pos+1, A, mem59, mem58);
    X = pos;
// Jump to ???
    goto pos41749;



pos41457:

// RULE:
//       UL -> AX L
// Example: MEDDLE

// Get phoneme
    A = phonemeindex[X];
// Skip this rule if phoneme is not UL
    if (A != 78) goto pos41487;              // 'UL'
    A = 24;                     // 'L'                 //change 'UL' to 'AX L'

    dbg_sam("RULE: UL -> AX L\n");

pos41466:
// Get current phoneme stress
    mem58 = stress[X];

// Change UL to AX
    phonemeindex[X] = 13;              // 'AX'
// Perform insert. Note code below may jump up here with different values
    Insert(X+1, A, mem59, mem58);
    pos++;
// Move to next phoneme
    continue;

pos41487:

// RULE:
//       UM -> AX M
// Example: ASTRONOMY

// Skip rule if phoneme != UM
    if (A != 79) goto pos41495;               // 'UM'
    // Jump up to branch - replaces current phoneme with AX and continues
    A = 27;             // 'M'  //change 'UM' to  'AX M'
    dbg_sam("RULE: UM -> AX M\n");
    goto pos41466;
pos41495:

// RULE:
//       UN -> AX N
// Example: FUNCTION


// Skip rule if phoneme != UN
    if (A != 80) goto pos41503;             // 'UN'

    // Jump up to branch - replaces current phoneme with AX and continues
    A = 28;                     // 'N' //change UN to 'AX N'
    dbg_sam("RULE: UN -> AX N\n");
    goto pos41466;
pos41503:

// RULE:
//       <STRESSED VOWEL> <SILENCE> <STRESSED VOWEL> -> <STRESSED VOWEL> <SILENCE> Q <VOWEL>
// EXAMPLE: AWAY EIGHT

    Y = A;
// VOWEL set?
    A = pgm_read_byte(&flags[A]) & 128;

