uli/basicengine-firmware/libraries/ESP8266SAM/src/sam.cpp
// Skip if not a vowel
    if (A != 0)
    {
// Get the stress
      A = stress[X];

// If stressed...
      if (A != 0)
      {
// Get the following phoneme
	X++;
	A = phonemeindex[X];
// If following phoneme is a pause

	if (A == 0)
	{
// Get the phoneme following pause
	  X++;
	  Y = phonemeindex[X];

// Check for end of buffer flag
	  if (Y == 255)                               //buffer overflow
// ??? Not sure about these flags
	    A = 65&128;
	  else
// And VOWEL flag to current phoneme's flags
	    A = pgm_read_byte(&flags[Y]) & 128;

// If following phonemes is not a pause
	  if (A != 0)
	  {
// If the following phoneme is not stressed
	    A = stress[X];
	    if (A != 0)
	    {
// Insert a glottal stop and move forward
	      dbg_sam("RULE: Insert glottal stop between two stressed vowels with space between them\n");
	      // 31 = 'Q'
	      Insert(X, 31, mem59, 0);
	      pos++;
	      continue;
	    }
	  }
	}
      }
    }


// RULES FOR PHONEMES BEFORE R
//        T R -> CH R
// Example: TRACK


// Get current position and phoneme
    X = pos;
    A = phonemeindex[pos];
    if (A != 23) goto pos41611;                 // 'R'

// Look at prior phoneme
    X--;
    A = phonemeindex[pos-1];
    //pos41567:
    if (A == 69)                                // 'T'
    {
// Change T to CH
      dbg_sam("RULE: T R -> CH R\n");
      phonemeindex[pos-1] = 42;
      goto pos41779;
    }


// RULES FOR PHONEMES BEFORE R
//        D R -> J R
// Example: DRY

// Prior phonemes D?
    if (A == 57)                                // 'D'
    {
// Change D to J
      phonemeindex[pos-1] = 44;
      dbg_sam("RULE: D R -> J R\n");
      goto pos41788;
    }

// RULES FOR PHONEMES BEFORE R
//        <VOWEL> R -> <VOWEL> RX
// Example: ART


// If vowel flag is set change R to RX
    A = pgm_read_byte(&flags[A]) & 128;
    dbg_sam("RULE: R -> RX\n");
    if (A != 0) phonemeindex[pos] = 18;              // 'RX'

// continue to next phoneme
    pos++;
    continue;

pos41611:

// RULE:
//       <VOWEL> L -> <VOWEL> LX
// Example: ALL

// Is phoneme L?
    if (A == 24)                // 'L'
    {
// If prior phoneme does not have VOWEL flag set, move to next phoneme
      if ((pgm_read_byte(&flags[phonemeindex[pos-1]]) & 128) == 0) {pos++; continue; }
// Prior phoneme has VOWEL flag set, so change L to LX and move to next phoneme
      dbg_sam("RULE: <VOWEL> L -> <VOWEL> LX\n");
      phonemeindex[X] = 19;                       // 'LX'
      pos++;
      continue;
    }

// RULE:
//       G S -> G Z
//
// Can't get to fire -
//       1. The G -> GX rule intervenes
//       2. Reciter already replaces GS -> GZ

// Is current phoneme S?
    if (A == 32)                // 'S'
    {
// If prior phoneme is not G, move to next phoneme
      if (phonemeindex[pos-1] != 60) {pos++; continue; }
// Replace S with Z and move on
      dbg_sam("RULE: G S -> G Z\n");
      phonemeindex[pos] = 38;                      // 'Z'
      pos++;
      continue;
    }

// RULE:
//             K <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> KX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
// Example: COW

// Is current phoneme K?
    if (A == 72)                // 'K'
    {
// Get next phoneme
      Y = phonemeindex[pos+1];
// If at end, replace current phoneme with KX
      if (Y == 255) phonemeindex[pos] = 75;                   // ML : prevents an index out of bounds problem
      else
      {
// VOWELS AND DIPHTONGS ENDING WITH IY SOUND flag set?
	A = pgm_read_byte(&flags[Y]) & 32;
	if (A == 0) dbg_sam("RULE: K <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> KX <VOWEL OR DIPHTONG NOT ENDING WITH IY>\n");
// Replace with KX
	if (A == 0) phonemeindex[pos] = 75;                          // 'KX'
      }
    }
    else

// RULE:
//             G <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> GX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
// Example: GO


// Is character a G?
    if (A == 60)               // 'G'
    {
// Get the following character
      unsigned char index = phonemeindex[pos+1];

// At end of buffer?
      if (index == 255)                   //prevent buffer overflow
      {
	pos++; continue;
      }
      else
// If diphtong ending with YX, move continue processing next phoneme
      if ((pgm_read_byte(&flags[index]) & 32) != 0) {pos++; continue; }
// replace G with GX and continue processing next phoneme
      dbg_sam("RULE: G <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> GX <VOWEL OR DIPHTONG NOT ENDING WITH IY>\n");
      phonemeindex[pos] = 63;                   // 'GX'
      pos++;
      continue;
    }

// RULE:
//      S P -> S B
//      S T -> S D
//      S K -> S G
//      S KX -> S GX
// Examples: SPY, STY, SKY, SCOWL

    Y = phonemeindex[pos];
    //pos41719:
// Replace with softer version?
    A = pgm_read_byte(&flags[Y]) & 1;
    if (A == 0) goto pos41749;
    A = phonemeindex[pos-1];
    if (A != 32)                // 'S'
    {
      A = Y;
      goto pos41812;
    }
    // Replace with softer version
    dbg_sam("RULE: S* %c%c -> S* %c%c\n", signInputTable1[Y], signInputTable2[Y], signInputTable1[Y-12], signInputTable2[Y-12]);
    phonemeindex[pos] = Y-12;
    pos++;
    continue;


pos41749:

// RULE:
//      <ALVEOLAR> UW -> <ALVEOLAR> UX
//
// Example: NEW, DEW, SUE, ZOO, THOO, TOO

//       UW -> UX

    A = phonemeindex[X];
    if (A == 53)                // 'UW'
    {
// ALVEOLAR flag set?
      Y = phonemeindex[X-1];
      A = pgm_read_byte(&flags2[Y]) & 4;
// If not set, continue processing next phoneme
      if (A == 0) {pos++; continue; }
      dbg_sam("RULE: <ALVEOLAR> UW -> <ALVEOLAR> UX\n");
      phonemeindex[X] = 16;
      pos++;
      continue;
    }
pos41779:

// RULE:
//       CH -> CH CH' (CH requires two phonemes to represent it)
// Example: CHEW

    if (A == 42)                // 'CH'
    {
      //        pos41783:
      dbg_sam("CH -> CH CH+1\n");
      Insert(X+1, A+1, mem59, stress[X]);
      pos++;
      continue;
    }

pos41788:

// RULE:
//       J -> J J' (J requires two phonemes to represent it)
// Example: JAY


    if (A == 44)             // 'J'
    {
      dbg_sam("J -> J J+1\n");
      Insert(X+1, A+1, mem59, stress[X]);
      pos++;
      continue;
    }

