uli/basicengine-firmware/libraries/ESP8266SAM/src/sam.cpp
// Jump here to continue
pos41812:

// RULE: Soften T following vowel
// NOTE: This rule fails for cases such as "ODD"
//       <UNSTRESSED VOWEL> T <PAUSE> -> <UNSTRESSED VOWEL> DX <PAUSE>
//       <UNSTRESSED VOWEL> D <PAUSE>  -> <UNSTRESSED VOWEL> DX <PAUSE>
// Example: PARTY, TARDY


// Past this point, only process if phoneme is T or D

    if (A != 69)                // 'T'
      if (A != 57) {pos++; continue; }                // 'D'
    //pos41825:


// If prior phoneme is not a vowel, continue processing phonemes
    if ((pgm_read_byte(&flags[phonemeindex[X-1]]) & 128) == 0) {pos++; continue; }

// Get next phoneme
    X++;
    A = phonemeindex[X];
    //pos41841
// Is the next phoneme a pause?
    if (A != 0)
    {
// If next phoneme is not a pause, continue processing phonemes
      if ((pgm_read_byte(&flags[A]) & 128) == 0) {pos++; continue; }
// If next phoneme is stressed, continue processing phonemes
// FIXME: How does a pause get stressed?
      if (stress[X] != 0) {pos++; continue; }
//pos41856:
// Set phonemes to DX
      dbg_sam("RULE: Soften T or D following vowel or ER and preceding a pause -> DX\n");
      phonemeindex[pos] = 30;                 // 'DX'
    } else
    {
      A = phonemeindex[X+1];
      if (A == 255)                   //prevent buffer overflow
	A = 65 & 128;
      else
// Is next phoneme a vowel or ER?
	A = pgm_read_byte(&flags[A]) & 128;
      if (A != 0) dbg_sam("RULE: Soften T or D following vowel or ER and preceding a pause -> DX\n");
      if (A != 0) phonemeindex[pos] = 30;                    // 'DX'
    }

    pos++;

  }       // while
}


// Applies various rules that adjust the lengths of phonemes
//
//         Lengthen <FRICATIVE> or <VOICED> between <VOWEL> and <PUNCTUATION> by 1.5
//         <VOWEL> <RX | LX> <CONSONANT> - decrease <VOWEL> length by 1
//         <VOWEL> <UNVOICED PLOSIVE> - decrease vowel by 1/8th
//         <VOWEL> <UNVOICED CONSONANT> - increase vowel by 1/2 + 1
//         <NASAL> <STOP CONSONANT> - set nasal = 5, consonant = 6
//         <VOICED STOP CONSONANT> {optional silence} <STOP CONSONANT> - shorten both to 1/2 + 1
//         <LIQUID CONSONANT> <DIPHTONG> - decrease by 2


//void Code48619()
void ESP8266SAM::AdjustLengths()
{

  // LENGTHEN VOWELS PRECEDING PUNCTUATION
  //
  // Search for punctuation. If found, back up to the first vowel, then
  // process all phonemes between there and up to (but not including) the punctuation.
  // If any phoneme is found that is a either a fricative or voiced, the duration is
  // increased by (length * 1.5) + 1

  // loop index
  X = 0;
  unsigned char index;

  // iterate through the phoneme list
  unsigned char loopIndex = 0;
  while (1)
  {
    // get a phoneme
    index = phonemeindex[X];

    // exit loop if end on buffer token
    if (index == 255) break;

    // not punctuation?
    if ((pgm_read_byte(&flags2[index]) & 1) == 0)
    {
      // skip
      X++;
      continue;
    }

    // hold index
    loopIndex = X;

    // Loop backwards from this point
pos48644:

    // back up one phoneme
    X--;

    // stop once the beginning is reached
    if (X == 0) break;

    // get the preceding phoneme
    index = phonemeindex[X];

    if (index != 255)             //inserted to prevent access overrun
      if ((pgm_read_byte(&flags[index]) & 128) == 0) goto pos48644;          // if not a vowel, continue looping

    //pos48657:
    do
    {
      // test for vowel
      index = phonemeindex[X];

      if (index != 255)                  //inserted to prevent access overrun
	// test for fricative/unvoiced or not voiced
	if (((pgm_read_byte(&flags2[index]) & 32) == 0) || ((pgm_read_byte(&flags[index]) & 4) != 0))                    //nochmal �berpr�fen
	{
	  //A = pgm_read_byte(&flags[Y]) & 4;
	  //if(A == 0) goto pos48688;

	  // get the phoneme length
	  A = phonemeLength[X];

	  // change phoneme length to (length * 1.5) + 1
	  A = (A >> 1) + A + 1;
	  dbg_sam("RULE: Lengthen <FRICATIVE> or <VOICED> between <VOWEL> and <PUNCTUATION> by 1.5\n");
	  dbg_sam("PRE\n");
	  dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);

	  phonemeLength[X] = A;

	  dbg_sam("POST\n");
	  dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);

	}
      // keep moving forward
      X++;
    } while (X != loopIndex);
    //	if (X != loopIndex) goto pos48657;
    X++;
  }        // while

  // Similar to the above routine, but shorten vowels under some circumstances

  // Loop throught all phonemes
  loopIndex = 0;
  //pos48697

  while (1)
  {
    // get a phoneme
    X = loopIndex;
    index = phonemeindex[X];

    // exit routine at end token
    if (index == 255) return;

    // vowel?
    A = pgm_read_byte(&flags[index]) & 128;
    if (A != 0)
    {
      // get next phoneme
      X++;
      index = phonemeindex[X];

      // get flags
      if (index == 255)
	mem56 = 65;                 // use if end marker
      else
	mem56 = pgm_read_byte(&flags[index]);

      // not a consonant
      if ((mem56 & 64) == 0)
      {
	// RX or LX?
	if ((index == 18) || (index == 19))                          // 'RX' & 'LX'
	{
	  // get the next phoneme
	  X++;
	  index = phonemeindex[X];

	  // next phoneme a consonant?
	  if (index < sizeof(flags) && (pgm_read_byte(&flags[index]) & 64) != 0) {
	    // RULE: <VOWEL> RX | LX <CONSONANT>


	    dbg_sam("RULE: <VOWEL> <RX | LX> <CONSONANT> - decrease length by 1\n");
	    dbg_sam("PRE\n");
	    dbg_sam("phoneme %d (%c%c) length %d\n", loopIndex, signInputTable1[phonemeindex[loopIndex]], signInputTable2[phonemeindex[loopIndex]], phonemeLength[loopIndex]);

	    // decrease length of vowel by 1 frame
	    phonemeLength[loopIndex]--;

	    dbg_sam("POST\n");
	    dbg_sam("phoneme %d (%c%c) length %d\n", loopIndex, signInputTable1[phonemeindex[loopIndex]], signInputTable2[phonemeindex[loopIndex]], phonemeLength[loopIndex]);

