uli/basicengine-firmware/libraries/ESP8266SAM/src/sam.cpp
	  }
	  // move ahead
	  loopIndex++;
	  continue;
	}
	// move ahead
	loopIndex++;
	continue;
      }


      // Got here if not <VOWEL>

      // not voiced
      if ((mem56 & 4) == 0)
      {

	// Unvoiced
	// *, .*, ?*, ,*, -*, DX, S*, SH, F*, TH, /H, /X, CH, P*, T*, K*, KX

	// not an unvoiced plosive?
	if ((mem56 & 1) == 0) {
	  // move ahead
	  loopIndex++;
	  continue;
	}

	// P*, T*, K*, KX


	// RULE: <VOWEL> <UNVOICED PLOSIVE>
	// <VOWEL> <P*, T*, K*, KX>

	// move back
	X--;

	dbg_sam("RULE: <VOWEL> <UNVOICED PLOSIVE> - decrease vowel by 1/8th\n");
	dbg_sam("PRE\n");
	dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);

	// decrease length by 1/8th
	mem56 = phonemeLength[X] >> 3;
	phonemeLength[X] -= mem56;

	dbg_sam("POST\n");
	dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);

	// move ahead
	loopIndex++;
	continue;
      }

      // RULE: <VOWEL> <VOICED CONSONANT>
      // <VOWEL> <WH, R*, L*, W*, Y*, M*, N*, NX, DX, Q*, Z*, ZH, V*, DH, J*, B*, D*, G*, GX>

      dbg_sam("RULE: <VOWEL> <VOICED CONSONANT> - increase vowel by 1/2 + 1\n");
      dbg_sam("PRE\n");
      dbg_sam("phoneme %d (%c%c) length %d\n", X-1, signInputTable1[phonemeindex[X-1]], signInputTable2[phonemeindex[X-1]], phonemeLength[X-1]);

      // decrease length
      A = phonemeLength[X-1];
      phonemeLength[X-1] = (A >> 2) + A + 1;                       // 5/4*A + 1

      dbg_sam("POST\n");
      dbg_sam("phoneme %d (%c%c) length %d\n", X-1, signInputTable1[phonemeindex[X-1]], signInputTable2[phonemeindex[X-1]], phonemeLength[X-1]);

      // move ahead
      loopIndex++;
      continue;

    }


    // WH, R*, L*, W*, Y*, M*, N*, NX, Q*, Z*, ZH, V*, DH, J*, B*, D*, G*, GX

//pos48821:

    // RULE: <NASAL> <STOP CONSONANT>
    //       Set punctuation length to 6
    //       Set stop consonant length to 5

    // nasal?
    if ((pgm_read_byte(&flags2[index]) & 8) != 0)
    {

      // M*, N*, NX,

      // get the next phoneme
      X++;
      index = phonemeindex[X];

      // end of buffer?
      if (index == 255)
	A = 65&2;         //prevent buffer overflow
      else
	A = pgm_read_byte(&flags[index]) & 2;         // check for stop consonant


      // is next phoneme a stop consonant?
      if (A != 0)

      // B*, D*, G*, GX, P*, T*, K*, KX

      {
	dbg_sam("RULE: <NASAL> <STOP CONSONANT> - set nasal = 5, consonant = 6\n");
	dbg_sam("POST\n");
	dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);
	dbg_sam("phoneme %d (%c%c) length %d\n", X-1, signInputTable1[phonemeindex[X-1]], signInputTable2[phonemeindex[X-1]], phonemeLength[X-1]);

	// set stop consonant length to 6
	phonemeLength[X] = 6;

	// set nasal length to 5
	phonemeLength[X-1] = 5;

	dbg_sam("POST\n");
	dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);
	dbg_sam("phoneme %d (%c%c) length %d\n", X-1, signInputTable1[phonemeindex[X-1]], signInputTable2[phonemeindex[X-1]], phonemeLength[X-1]);

      }
      // move to next phoneme
      loopIndex++;
      continue;
    }


    // WH, R*, L*, W*, Y*, Q*, Z*, ZH, V*, DH, J*, B*, D*, G*, GX

    // RULE: <VOICED STOP CONSONANT> {optional silence} <STOP CONSONANT>
    //       Shorten both to (length/2 + 1)

    // (voiced) stop consonant?
    if ((pgm_read_byte(&flags[index]) & 2) != 0)
    {
      // B*, D*, G*, GX

      // move past silence
      do
      {
	// move ahead
	X++;
	index = phonemeindex[X];
      } while (index == 0);


      // check for end of buffer
      if (index == 255)       //buffer overflow
      {
	// ignore, overflow code
	if ((65 & 2) == 0) {loopIndex++; continue; }
      } else if ((pgm_read_byte(&flags[index]) & 2) == 0) {
	// if another stop consonant, move ahead
	loopIndex++;
	continue;
      }

      // RULE: <UNVOICED STOP CONSONANT> {optional silence} <STOP CONSONANT>
      dbg_sam("RULE: <UNVOICED STOP CONSONANT> {optional silence} <STOP CONSONANT> - shorten both to 1/2 + 1\n");
      dbg_sam("PRE\n");
      dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);
      dbg_sam("phoneme %d (%c%c) length %d\n", X-1, signInputTable1[phonemeindex[X-1]], signInputTable2[phonemeindex[X-1]], phonemeLength[X-1]);
// X gets overwritten, so hold prior X value for debug statement
      int debugX = X;
      // shorten the prior phoneme length to (length/2 + 1)
      phonemeLength[X] = (phonemeLength[X] >> 1) + 1;
      X = loopIndex;

      // also shorten this phoneme length to (length/2 +1)
      phonemeLength[loopIndex] = (phonemeLength[loopIndex] >> 1) + 1;

      dbg_sam("POST\n");
      dbg_sam("phoneme %d (%c%c) length %d\n", debugX, signInputTable1[phonemeindex[debugX]], signInputTable2[phonemeindex[debugX]], phonemeLength[debugX]);
      dbg_sam("phoneme %d (%c%c) length %d\n", debugX-1, signInputTable1[phonemeindex[debugX-1]], signInputTable2[phonemeindex[debugX-1]], phonemeLength[debugX-1]);


      // move ahead
      loopIndex++;
      continue;
    }


    // WH, R*, L*, W*, Y*, Q*, Z*, ZH, V*, DH, J*, **,

    // RULE: <VOICED NON-VOWEL> <DIPHTONG>
    //       Decrease <DIPHTONG> by 2

    // liquic consonant?
    if ((pgm_read_byte(&flags2[index]) & 16) != 0)
    {
      // R*, L*, W*, Y*

      // get the prior phoneme
      index = phonemeindex[X-1];

      // prior phoneme a stop consonant>
      if ((pgm_read_byte(&flags[index]) & 2) != 0) {
	// Rule: <LIQUID CONSONANT> <DIPHTONG>

	dbg_sam("RULE: <LIQUID CONSONANT> <DIPHTONG> - decrease by 2\n");
        dbg_sam("PRE\n");
        dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);

        // decrease the phoneme length by 2 frames (20 ms)
        phonemeLength[X] -= 2;

        dbg_sam("POST\n");
        dbg_sam("phoneme %d (%c%c) length %d\n", X, signInputTable1[phonemeindex[X]], signInputTable2[phonemeindex[X]], phonemeLength[X]);
      }
    }

    // move to next phoneme
    loopIndex++;
    continue;
  }
//            goto pos48701;
}

// -------------------------------------------------------------------------
// ML : Code47503 is division with remainder, and mem50 gets the sign
void ESP8266SAM::Code47503(unsigned char mem52)
{

  Y = 0;
  if ((mem53 & 128) != 0)
  {
    mem53 = -mem53;
    Y = 128;
  }
  mem50 = Y;
  A = 0;
  for (X = 8; X > 0; X--)
  {
    int temp = mem53;
    mem53 = mem53 << 1;
    A = A << 1;
    if (temp >= 128) A++;
    if (A >= mem52)
    {
      A = A - mem52;
      mem53++;
    }
  }

  mem51 = A;
  if ((mem50 & 128) != 0) mem53 = -mem53;

}
